Revit 2026 API

# ColumnAttachment Class

---

An object representing the attachment of the top or bottom of a column to some target: a floor, roof, ceiling, beam, or brace.

SystemObject Autodesk.Revit.DBColumnAttachment

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ColumnAttachment : IDisposable
```
```vb
Public Class ColumnAttachment
	Implements IDisposable
```
```cpp
public ref class ColumnAttachment : IDisposable
```
```fsharp
type ColumnAttachment =
    class
        interface IDisposable
    end
```

The ColumnAttachment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AttachOffset | The offset of the column attachment. |
|  | BaseOrTop | Identifies if this ColumnAttachment is at the base or top of the column. |
|  | CutStyle | Identifies whether the column, or the attached element should be cut (or if neither should be cut). |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Justification | Identifies the type of justification to apply to this ColumnAttachment. |
|  | TargetId | The id of the element that is attached to the column and is described by this ColumnAttachment. |

|  | Name | Description |
| --- | --- | --- |
|  | AddColumnAttachment | Attaches the column to the target. If an attachment already exists with the same "baseOrTop" value, no attachment is made. |
|  | Dispose | Releases all resources used by the ColumnAttachment |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetColumnAttachment(FamilyInstance, ElementId) | Look up a column attachment by specifying the target id. |
|  | GetColumnAttachment(FamilyInstance, Int32) | Look up a column attachment. There is at most one attachment on the base and one on the top. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidColumn | Says whether a FamilyInstance supports column attachments. |
|  | IsValidTarget(Boolean, Element) | Says whether the element can be used as a target for a new attachment. |
|  | IsValidTarget(FamilyInstance, Element) | Says whether the element can be used as a target for a new attachment. |
|  | RemoveColumnAttachment(FamilyInstance, ElementId) | Removes any attachment of the column to the specified target. |
|  | RemoveColumnAttachment(FamilyInstance, Int32) | Removes an attachment at the top or base of a column, if there is one. |
|  | SetJustification | Setter of ColumnAttachmentJustification |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Call IsValidColumn() and IsValidTarget() to verify that specific elements support column attachments. A column has at most one top attachment and one bottom attachment.

#### Reference

Autodesk.Revit.DB Namespace